def top3():
	courses = ["Python-разработчик с нуля", "Java-разработчик с нуля", "Fullstack-разработчик на Python", "Frontend-разработчик с нуля"]
	mentors = [
		["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
		["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
		["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
		["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
	]

	all_list = []
	for m in mentors:
		all_list.extend(m)
	all_names_list = []
	for mentor in all_list:
		name = mentor.split()[0]
		all_names_list.append(name)

	unique_names = list(set(all_names_list))

	popular = []
	for name in list(set(unique_names)):
		popular.append([name, all_names_list.count(name)])

	popular.sort(key=lambda x:x[1], reverse=True)

	top_3 = [f"{str(x[0])}: {str(x[1])} раз(а)" for x in popular[:3]]
	return ", ".join(top_3)

def cleans_task2():
	courses = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля",
			   "Frontend-разработчик с нуля"]
	mentors = [
		["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев",
		 "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
		 "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов",
		 "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
		["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский",
		 "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая",
		 "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
		["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев",
		 "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина",
		 "Азамат Искаков", "Роман Гордиенко"],
		["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
		 "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
	]
	durations = [14, 20, 12, 20]
	courses_list = []
	for course, mentor, duration in zip(courses, mentors, durations):
		course_dict = {"title":course, "mentors":mentor, "duration":duration}
		courses_list.append(course_dict)

	durations_dict = {}

	for id, kyrs in enumerate(courses_list):
		key = kyrs['duration']
		if key not in durations_dict:
			durations_dict[key] = []
		durations_dict[key].append(id)

	durations_dict = dict(sorted(durations_dict.items()))
	result = ''
	for values, ids in durations_dict.items():
		for id in ids:
			result += f"{courses_list[id]['title']} - {values} месяцев\n"
	return result

def solve(phrases):


	result = []

	for phrase in phrases:
		palidroms = phrase
		phrase = phrase.replace(" ","")
		if phrase == phrase[::-1]:
			result.append(palidroms)

	return result


if __name__=='__main__':
	print(solve(phrases = ["нажал кабан на баклажан", "дом как комод", "рвал дед лавр", "азот калий и лактоза",
						   "а собака боса", "тонет енот", "карман мрак", "пуст суп"]))
	print (top3())
	print (cleans_task2())